socialNetwork/results/scaling-off-sweep-bench1.5-may19/benchmark1.5b-noscale-sweep-05-19-26_045455/st5-AttUpd/800.txt
Running 2m test @ http://155.98.37.84:80
  16 threads and 128 connections

  Thread calibration: mean lat.: 2302.911ms, rate sampling interval: 9035ms
  Thread calibration: mean lat.: 2295.385ms, rate sampling interval: 8880ms
  Thread calibration: mean lat.: 2432.723ms, rate sampling interval: 9781ms
  Thread calibration: mean lat.: 2205.979ms, rate sampling interval: 8929ms
  Thread calibration: mean lat.: 2103.845ms, rate sampling interval: 8511ms
  Thread calibration: mean lat.: 2168.637ms, rate sampling interval: 9273ms
  Thread calibration: mean lat.: 2340.889ms, rate sampling interval: 9428ms
  Thread calibration: mean lat.: 2262.878ms, rate sampling interval: 8986ms
  Thread calibration: mean lat.: 2335.098ms, rate sampling interval: 8880ms
  Thread calibration: mean lat.: 2150.927ms, rate sampling interval: 8544ms
  Thread calibration: mean lat.: 2531.265ms, rate sampling interval: 8830ms
  Thread calibration: mean lat.: 2724.366ms, rate sampling interval: 10452ms
  Thread calibration: mean lat.: 2126.675ms, rate sampling interval: 8257ms
  Thread calibration: mean lat.: 2112.803ms, rate sampling interval: 8626ms
  Thread calibration: mean lat.: 2022.774ms, rate sampling interval: 7913ms
  Thread calibration: mean lat.: 2451.942ms, rate sampling interval: 9854ms

-----------------------------------------------------------------------
Test Results @ http://155.98.37.84:80 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    31.70s    16.09s    1.03m    58.57%
    Req/Sec    24.31      1.54    28.00     88.30%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   31.29s 
 75.000%   45.29s 
 90.000%    0.90m 
 99.000%    1.03m 
 99.900%    1.08m 
 99.990%    1.10m 
 99.999%    1.11m 
100.000%    1.11m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    2787.327     0.000000            1         1.00
   10346.495     0.100000         4356         1.11
   15163.391     0.200000         8711         1.25
   19808.255     0.300000        13073         1.43
   25280.511     0.400000        17422         1.67
   31293.439     0.500000        21772         2.00
   34242.559     0.550000        23969         2.22
   37093.375     0.600000        26137         2.50
   39845.887     0.650000        28317         2.86
   42631.167     0.700000        30510         3.33
   45285.375     0.750000        32679         4.00
   46694.399     0.775000        33771         4.44
   48070.655     0.800000        34854         5.00
   49512.447     0.825000        35927         5.71
   50987.007     0.850000        37038         6.67
   52494.335     0.875000        38106         8.00
   53280.767     0.887500        38656         8.89
   54099.967     0.900000        39213        10.00
   54886.399     0.912500        39742        11.43
   55738.367     0.925000        40298        13.33
   56688.639     0.937500        40825        16.00
   57147.391     0.943750        41100        17.78
   57606.143     0.950000        41378        20.00
   58163.199     0.956250        41643        22.86
   58753.023     0.962500        41926        26.67
   59244.543     0.968750        42191        32.00
   59539.455     0.971875        42319        35.56
   59899.903     0.975000        42465        40.00
   60293.119     0.978125        42595        45.71
   60620.799     0.981250        42729        53.33
   61014.015     0.984375        42863        64.00
   61276.159     0.985938        42940        71.11
   61505.535     0.987500        43000        80.00
   61767.679     0.989062        43068        91.43
   62062.591     0.990625        43140       106.67
   62324.735     0.992188        43203       128.00
   62554.111     0.992969        43240       142.22
   62750.719     0.993750        43271       160.00
   63012.863     0.994531        43306       182.86
   63242.239     0.995313        43340       213.33
   63471.615     0.996094        43377       256.00
   63602.687     0.996484        43390       284.44
   63799.295     0.996875        43407       320.00
   63963.135     0.997266        43425       365.71
   64159.743     0.997656        43442       426.67
   64389.119     0.998047        43458       512.00
   64552.959     0.998242        43470       568.89
   64618.495     0.998437        43479       640.00
   64749.567     0.998633        43485       731.43
   64815.103     0.998828        43493       853.33
   64946.175     0.999023        43501      1024.00
   65011.711     0.999121        43505      1137.78
   65142.783     0.999219        43509      1280.00
   65273.855     0.999316        43517      1462.86
   65306.623     0.999414        43518      1706.67
   65503.231     0.999512        43522      2048.00
   65535.999     0.999561        43525      2275.56
   65568.767     0.999609        43526      2560.00
   65667.071     0.999658        43529      2925.71
   65732.607     0.999707        43531      3413.33
   65798.143     0.999756        43533      4096.00
   65863.679     0.999780        43534      4551.11
   65929.215     0.999805        43536      5120.00
   65929.215     0.999829        43536      5851.43
   65961.983     0.999854        43537      6826.67
   66093.055     0.999878        43538      8192.00
   66125.823     0.999890        43540      9102.22
   66125.823     0.999902        43540     10240.00
   66125.823     0.999915        43540     11702.86
   66125.823     0.999927        43540     13653.33
   66191.359     0.999939        43541     16384.00
   66191.359     0.999945        43541     18204.44
   66191.359     0.999951        43541     20480.00
   66256.895     0.999957        43542     23405.71
   66256.895     0.999963        43542     27306.67
   66256.895     0.999969        43542     32768.00
   66256.895     0.999973        43542     36408.89
   66256.895     0.999976        43542     40960.00
   66551.807     0.999979        43543     46811.43
   66551.807     1.000000        43543          inf
#[Mean    =    31696.767, StdDeviation   =    16092.335]
#[Max     =    66519.040, Total count    =        43543]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  47422 requests in 2.00m, 582.87MB read
Requests/sec:    395.14  
Transfer/sec:      4.86MB